# AlignmentStationLabelOptions Constructor (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
AlignmentStationLabelOptions Constructor
AlignmentStationLabelOptions Class See Also
---
Creates an object with default values.
**Namespace:** Autodesk.Revit.DB.Infrastructure**Assembly:** Autodesk.CivilAlignments.DBApplication (in Autodesk.CivilAlignments.DBApplication.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021.1
# Syntax
C#
---
```text
public AlignmentStationLabelOptions(
	double station
)
```

Visual Basic
---
```text
Public Sub New ( _
	station As Double _
)
```

Visual C++
---
```text
public:
AlignmentStationLabelOptions(
	double station
)
```

# ### Parameters
station
    Type: System..::..DoubleThe station at which the label will be placed.
# See Also
AlignmentStationLabelOptions Class
Autodesk.Revit.DB.Infrastructure Namespace